resources/testplans/mongodb/TestPlan-MongoDB-GridFSRead-Composite.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="2.4" jmeter="2.9 r1437961">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="MongoDB-GFS-Random-Read-Results-Composite" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="testPlanName" elementType="Argument">
            <stringProp name="Argument.name">testPlanName</stringProp>
            <stringProp name="Argument.value">MongoDB-GFS-Random-Read-Results-Composite</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="numberOfThreads" elementType="Argument">
            <stringProp name="Argument.name">numberOfThreads</stringProp>
            <stringProp name="Argument.value">1500</stringProp>
            <stringProp name="Argument.desc">The number of threads.</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="rampUpTime" elementType="Argument">
            <stringProp name="Argument.name">rampUpTime</stringProp>
            <stringProp name="Argument.value">1500</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
            <stringProp name="Argument.desc">Ramp up time [sec]</stringProp>
          </elementProp>
          <elementProp name="host" elementType="Argument">
            <stringProp name="Argument.name">host</stringProp>
            <stringProp name="Argument.value">cloudssd-mongo.cern.ch</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
            <stringProp name="Argument.desc">Host to connect to.</stringProp>
          </elementProp>
          <elementProp name="database" elementType="Argument">
            <stringProp name="Argument.name">database</stringProp>
            <stringProp name="Argument.value">conddb</stringProp>
            <stringProp name="Argument.desc">Database name</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="data" elementType="Argument">
            <stringProp name="Argument.name">data</stringProp>
            <stringProp name="Argument.value">/mnt/testdata/</stringProp>
            <stringProp name="Argument.desc">Path for testdata.</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </Arguments>
      <hashTree/>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Iperf" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">1</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <longProp name="ThreadGroup.start_time">1392294966000</longProp>
        <longProp name="ThreadGroup.end_time">1392294966000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <SystemSampler guiclass="SystemSamplerGui" testclass="SystemSampler" testname="Iperf Sampler" enabled="true">
          <boolProp name="SystemSampler.checkReturnCode">true</boolProp>
          <stringProp name="SystemSampler.expectedReturnCode">0</stringProp>
          <stringProp name="SystemSampler.command">iperf</stringProp>
          <elementProp name="SystemSampler.arguments" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="Argument">
                <stringProp name="Argument.value">-c</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="" elementType="Argument">
                <stringProp name="Argument.value">${host}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="" elementType="Argument">
                <stringProp name="Argument.value">-t 1</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="" elementType="Argument">
                <stringProp name="Argument.value">-P 10</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <elementProp name="SystemSampler.environment" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="SystemSampler.stdout">./${testPlanName}/iperflog_${__threadNum}_${__machineName}_to_${host}.log</stringProp>
          <stringProp name="SystemSampler.stderr">./${testPlanName}/iperflog_${__threadNum}_${__machineName}_to_${host}.log</stringProp>
        </SystemSampler>
        <hashTree>
          <ResultCollector guiclass="SimpleDataWriter" testclass="ResultCollector" testname="Simple Data Writer" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
            <stringProp name="filename">./${testPlanName}/iperfSampleResults.csv</stringProp>
          </ResultCollector>
          <hashTree/>
        </hashTree>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="QueryHandlers" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">${numberOfThreads}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${rampUpTime}</stringProp>
        <longProp name="ThreadGroup.start_time">1385029359000</longProp>
        <longProp name="ThreadGroup.end_time">1385029359000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.delayedStart">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <mongodb.MongoConfigElement guiclass="TestBeanGUI" testclass="mongodb.MongoConfigElement" testname="Custom - MongoDB Connection Configuration" enabled="true">
          <stringProp name="autoConnectRetry">False</stringProp>
          <stringProp name="connectTimeout">0</stringProp>
          <stringProp name="connectionId">mongoConn</stringProp>
          <stringProp name="connectionsPerHost">100</stringProp>
          <stringProp name="database">${database}</stringProp>
          <stringProp name="host">${host}</stringProp>
          <stringProp name="maxAutoConnectRetryTime">0</stringProp>
          <stringProp name="maxWaitTime">120000</stringProp>
          <stringProp name="password">testPass</stringProp>
          <stringProp name="port">27017</stringProp>
          <stringProp name="socketKeepAlive">True</stringProp>
          <stringProp name="socketTimeout">0</stringProp>
          <stringProp name="threadsAllowedToBlockMultiplier">50</stringProp>
        </mongodb.MongoConfigElement>
        <hashTree/>
        <assignment.AssignmentConfigElement guiclass="TestBeanGUI" testclass="assignment.AssignmentConfigElement" testname="Custom - Assignment Configuration" enabled="true">
          <stringProp name="assignmentFile">unspecified</stringProp>
          <stringProp name="assignmentInfo">assignInfo</stringProp>
          <stringProp name="assignmentMode">random</stringProp>
          <stringProp name="binaryInfo">binInfo</stringProp>
          <stringProp name="inputLocation">${data}</stringProp>
          <stringProp name="encoding">binary</stringProp>
          <stringProp name="numberOfAssignments">${numberOfThreads}</stringProp>
        </assignment.AssignmentConfigElement>
        <hashTree/>
        <mongodb.MongoSampler guiclass="TestBeanGUI" testclass="mongodb.MongoSampler" testname="Custom - MongoDB Sampler" enabled="true">
          <stringProp name="assignmentInfo">assignInfo</stringProp>
          <stringProp name="connectionId">mongoConn</stringProp>
          <stringProp name="gridFsMethod">True</stringProp>
          <stringProp name="requestType">read</stringProp>
          <stringProp name="useChunks">False</stringProp>
          <stringProp name="validateOperation">False</stringProp>
        </mongodb.MongoSampler>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Sudden QueryHandlers1" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">1950</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1300</stringProp>
        <longProp name="ThreadGroup.start_time">1385029359000</longProp>
        <longProp name="ThreadGroup.end_time">1385029359000</longProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">1500</stringProp>
        <stringProp name="ThreadGroup.delay">200</stringProp>
        <boolProp name="ThreadGroup.delayedStart">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <mongodb.MongoConfigElement guiclass="TestBeanGUI" testclass="mongodb.MongoConfigElement" testname="Custom - MongoDB Connection Configuration" enabled="true">
          <stringProp name="autoConnectRetry">False</stringProp>
          <stringProp name="connectTimeout">0</stringProp>
          <stringProp name="connectionId">mongoConn1</stringProp>
          <stringProp name="connectionsPerHost">100</stringProp>
          <stringProp name="database">${database}</stringProp>
          <stringProp name="host">${host}</stringProp>
          <stringProp name="maxAutoConnectRetryTime">0</stringProp>
          <stringProp name="maxWaitTime">120000</stringProp>
          <stringProp name="password">testPass</stringProp>
          <stringProp name="port">27017</stringProp>
          <stringProp name="socketKeepAlive">True</stringProp>
          <stringProp name="socketTimeout">0</stringProp>
          <stringProp name="threadsAllowedToBlockMultiplier">50</stringProp>
        </mongodb.MongoConfigElement>
        <hashTree/>
        <assignment.AssignmentConfigElement guiclass="TestBeanGUI" testclass="assignment.AssignmentConfigElement" testname="Custom - Assignment Configuration" enabled="true">
          <stringProp name="assignmentFile">unspecified</stringProp>
          <stringProp name="assignmentInfo">assignInfo1</stringProp>
          <stringProp name="assignmentMode">random</stringProp>
          <stringProp name="binaryInfo">binInfo</stringProp>
          <stringProp name="inputLocation">${data}</stringProp>
          <stringProp name="encoding">binary</stringProp>
          <stringProp name="numberOfAssignments">1950</stringProp>
        </assignment.AssignmentConfigElement>
        <hashTree/>
        <mongodb.MongoSampler guiclass="TestBeanGUI" testclass="mongodb.MongoSampler" testname="Custom - MongoDB Sampler - 1" enabled="true">
          <stringProp name="assignmentInfo">assignInfo1</stringProp>
          <stringProp name="connectionId">mongoConn1</stringProp>
          <stringProp name="gridFsMethod">True</stringProp>
          <stringProp name="requestType">read</stringProp>
          <stringProp name="useChunks">False</stringProp>
          <stringProp name="validateOperation">False</stringProp>
        </mongodb.MongoSampler>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Sudden QueryHandlers2" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">1650</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1100</stringProp>
        <longProp name="ThreadGroup.start_time">1385029359000</longProp>
        <longProp name="ThreadGroup.end_time">1385029359000</longProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">1500</stringProp>
        <stringProp name="ThreadGroup.delay">400</stringProp>
        <boolProp name="ThreadGroup.delayedStart">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <mongodb.MongoConfigElement guiclass="TestBeanGUI" testclass="mongodb.MongoConfigElement" testname="Custom - MongoDB Connection Configuration" enabled="true">
          <stringProp name="autoConnectRetry">False</stringProp>
          <stringProp name="connectTimeout">0</stringProp>
          <stringProp name="connectionId">mongoConn2</stringProp>
          <stringProp name="connectionsPerHost">100</stringProp>
          <stringProp name="database">${database}</stringProp>
          <stringProp name="host">${host}</stringProp>
          <stringProp name="maxAutoConnectRetryTime">0</stringProp>
          <stringProp name="maxWaitTime">120000</stringProp>
          <stringProp name="password">testPass</stringProp>
          <stringProp name="port">27017</stringProp>
          <stringProp name="socketKeepAlive">True</stringProp>
          <stringProp name="socketTimeout">0</stringProp>
          <stringProp name="threadsAllowedToBlockMultiplier">50</stringProp>
        </mongodb.MongoConfigElement>
        <hashTree/>
        <assignment.AssignmentConfigElement guiclass="TestBeanGUI" testclass="assignment.AssignmentConfigElement" testname="Custom - Assignment Configuration" enabled="true">
          <stringProp name="assignmentFile">unspecified</stringProp>
          <stringProp name="assignmentInfo">assignInfo2</stringProp>
          <stringProp name="assignmentMode">random</stringProp>
          <stringProp name="binaryInfo">binInfo</stringProp>
          <stringProp name="inputLocation">${data}</stringProp>
          <stringProp name="encoding">binary</stringProp>
          <stringProp name="numberOfAssignments">1650</stringProp>
        </assignment.AssignmentConfigElement>
        <hashTree/>
        <mongodb.MongoSampler guiclass="TestBeanGUI" testclass="mongodb.MongoSampler" testname="Custom - MongoDB Sampler - 2" enabled="true">
          <stringProp name="assignmentInfo">assignInfo2</stringProp>
          <stringProp name="connectionId">mongoConn2</stringProp>
          <stringProp name="gridFsMethod">True</stringProp>
          <stringProp name="requestType">read</stringProp>
          <stringProp name="useChunks">False</stringProp>
          <stringProp name="validateOperation">False</stringProp>
        </mongodb.MongoSampler>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Sudden QueryHandlers3" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">1350</stringProp>
        <stringProp name="ThreadGroup.ramp_time">900</stringProp>
        <longProp name="ThreadGroup.start_time">1385029359000</longProp>
        <longProp name="ThreadGroup.end_time">1385029359000</longProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">1500</stringProp>
        <stringProp name="ThreadGroup.delay">600</stringProp>
        <boolProp name="ThreadGroup.delayedStart">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <mongodb.MongoConfigElement guiclass="TestBeanGUI" testclass="mongodb.MongoConfigElement" testname="Custom - MongoDB Connection Configuration" enabled="true">
          <stringProp name="autoConnectRetry">False</stringProp>
          <stringProp name="connectTimeout">0</stringProp>
          <stringProp name="connectionId">mongoConn3</stringProp>
          <stringProp name="connectionsPerHost">100</stringProp>
          <stringProp name="database">${database}</stringProp>
          <stringProp name="host">${host}</stringProp>
          <stringProp name="maxAutoConnectRetryTime">0</stringProp>
          <stringProp name="maxWaitTime">120000</stringProp>
          <stringProp name="password">testPass</stringProp>
          <stringProp name="port">27017</stringProp>
          <stringProp name="socketKeepAlive">True</stringProp>
          <stringProp name="socketTimeout">0</stringProp>
          <stringProp name="threadsAllowedToBlockMultiplier">50</stringProp>
        </mongodb.MongoConfigElement>
        <hashTree/>
        <assignment.AssignmentConfigElement guiclass="TestBeanGUI" testclass="assignment.AssignmentConfigElement" testname="Custom - Assignment Configuration" enabled="true">
          <stringProp name="assignmentFile">unspecified</stringProp>
          <stringProp name="assignmentInfo">assignInfo3</stringProp>
          <stringProp name="assignmentMode">random</stringProp>
          <stringProp name="binaryInfo">binInfo</stringProp>
          <stringProp name="inputLocation">${data}</stringProp>
          <stringProp name="encoding">binary</stringProp>
          <stringProp name="numberOfAssignments">1350</stringProp>
        </assignment.AssignmentConfigElement>
        <hashTree/>
        <mongodb.MongoSampler guiclass="TestBeanGUI" testclass="mongodb.MongoSampler" testname="Custom - MongoDB Sampler - 3" enabled="true">
          <stringProp name="assignmentInfo">assignInfo3</stringProp>
          <stringProp name="connectionId">mongoConn3</stringProp>
          <stringProp name="gridFsMethod">True</stringProp>
          <stringProp name="requestType">read</stringProp>
          <stringProp name="useChunks">False</stringProp>
          <stringProp name="validateOperation">False</stringProp>
        </mongodb.MongoSampler>
        <hashTree/>
      </hashTree>
      <ResultCollector guiclass="SimpleDataWriter" testclass="ResultCollector" testname="Simple Data Writer" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <stringProp name="filename">./${testPlanName}/MongoRandomReadComposite-ALL.csv</stringProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>